In [262]:
import pandas as pd 
import requests
from bs4 import BeautifulSoup
import numpy as np

In [263]:
url= 'https://www.finelib.com/cities/lagos/areas-and-suburbs'
headers= {'User-Agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/86.0.4240.111 Safari/537.36'}

In [264]:
r = requests.get(url, headers=headers)
r.status_code

200

In [265]:
area = BeautifulSoup(r.text, 'html.parser')

In [266]:
names = area.select('a[href^="/cities/lagos/areas-and-suburbs/"]')

In [267]:
areas=[]
for name in names:
    areas.append(name.get_text(strip=True))
print(areas)

['Abule', 'Adeniyi Jones', 'Agege', 'Agidingbi', 'Aguda', 'Ajah', 'Ajegunle', 'Ajeromi-Ifelodun', 'Akerele', 'Akoka', 'Alaba', 'Alagomeji', 'Alausa', 'Alimosho', 'Amuwo Odofin', 'Anthony Village', 'Apapa', 'Badagry', 'Bariga', 'Coker', 'Dolphin Estate', 'Dopemu', 'Ebute Metta', 'Epe', 'Eti-Osa', 'Festac Town', 'Gbagada', 'Idumota', 'Ifako - Ijaiye', 'Ijesha', 'Ijora', 'Ikeja', 'Ikorodu', 'Ikoyi', 'Ilasamaja', 'Ilupeju', 'Iwaya', 'Iyana Ipaja', 'Jibowu', 'Ketu', 'Kosofe', 'Ladipo', 'Lagos Island', 'Lagos Mainland', 'Lawanson', 'Lekki', 'Marina', 'Maryland', 'Masha', 'Maza Maza', 'Mende', 'Mile 2', 'Mushin', 'Obalende', 'Obanikoro', 'Ogba', 'Ogudu', 'Ojo', 'Ojodu', 'Ojodu Berger', 'Ojota', 'Ojuelegba', 'Olodi', 'Onigbongbo', 'Onipanu', 'Oniru', 'Opebi', 'Oregun', 'Oshodi - Isolo', 'Palmgrove', 'Papa Ajao', 'Sabo', 'Satellite Town', 'Shomolu', 'Surulere', 'Takwa Bay', 'Tinubu Square', 'Victoria Garden City', 'Victoria Island', 'Yaba']

In [268]:
len(area)

3

In [269]:
pro = pd.read_csv('./propertypro_lagos_rent.csv')

In [270]:
pro.drop(pro[pro.price == '6,500,000/year'].index, inplace=True)

In [271]:
pro.head()

,Unnamed: 0,title,address,date_added,bed,bath,toilet,price
0,1,2 BEDROOM FLAT / APARTMENT FOR RENT,Mende Maryland Lagos,Added 19 Nov 2020,2 beds,2 baths,2 Toilets,"1,000,000"
1,2,3 BEDROOM FLAT / APARTMENT FOR RENT,Ajao estate IsoloAjao Estate Isolo Lagos,Added 19 Nov 2020,3 beds,3 baths,4 Toilets,"1,500,000"
2,3,5 BEDROOM DETACHED DUPLEX HOUSE FOR RENT,Chevron Lekki Lagos,"Updated 19 Nov 2020, Added 05 Nov 2020",5 beds,5 baths,6 Toilets,"4,000,000"
3,4,4 BEDROOM DETACHED DUPLEX HOUSE FOR RENT,Osapa London Lekki Lagos,"Updated 19 Nov 2020, Added 13 Nov 2020",4 beds,4 baths,5 Toilets,"3,500,000"
4,5,5 BEDROOM OFFICE SPACE COMMERCIAL PROPERTY FOR...,off coker roadCoker Road Ilupeju Lagos,Added 18 Nov 2020,5 beds,5 baths,7 Toilets,"5,000,000"

In [272]:
pro.price = pro.price.str.replace(',', '')

In [273]:
pro.head()

,Unnamed: 0,title,address,date_added,bed,bath,toilet,price
0,1,2 BEDROOM FLAT / APARTMENT FOR RENT,Mende Maryland Lagos,Added 19 Nov 2020,2 beds,2 baths,2 Toilets,1000000
1,2,3 BEDROOM FLAT / APARTMENT FOR RENT,Ajao estate IsoloAjao Estate Isolo Lagos,Added 19 Nov 2020,3 beds,3 baths,4 Toilets,1500000
2,3,5 BEDROOM DETACHED DUPLEX HOUSE FOR RENT,Chevron Lekki Lagos,"Updated 19 Nov 2020, Added 05 Nov 2020",5 beds,5 baths,6 Toilets,4000000
3,4,4 BEDROOM DETACHED DUPLEX HOUSE FOR RENT,Osapa London Lekki Lagos,"Updated 19 Nov 2020, Added 13 Nov 2020",4 beds,4 baths,5 Toilets,3500000
4,5,5 BEDROOM OFFICE SPACE COMMERCIAL PROPERTY FOR...,off coker roadCoker Road Ilupeju Lagos,Added 18 Nov 2020,5 beds,5 baths,7 Toilets,5000000

In [274]:
pro.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1050 entries, 0 to 1098
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  1050 non-null   int64
 1   title       1050 non-null   object
 2   address     1050 non-null   object
 3   date_added  1050 non-null   object
 4   bed         1050 non-null   object
 5   bath        1050 non-null   object
 6   toilet      1050 non-null   object
 7   price       1050 non-null   object
dtypes: int64(1), object(7)
memory usage: 73.8+ KB

In [275]:
pro.price =pro['price'].astype(int)

In [276]:
pro.head()

,Unnamed: 0,title,address,date_added,bed,bath,toilet,price
0,1,2 BEDROOM FLAT / APARTMENT FOR RENT,Mende Maryland Lagos,Added 19 Nov 2020,2 beds,2 baths,2 Toilets,1000000
1,2,3 BEDROOM FLAT / APARTMENT FOR RENT,Ajao estate IsoloAjao Estate Isolo Lagos,Added 19 Nov 2020,3 beds,3 baths,4 Toilets,1500000
2,3,5 BEDROOM DETACHED DUPLEX HOUSE FOR RENT,Chevron Lekki Lagos,"Updated 19 Nov 2020, Added 05 Nov 2020",5 beds,5 baths,6 Toilets,4000000
3,4,4 BEDROOM DETACHED DUPLEX HOUSE FOR RENT,Osapa London Lekki Lagos,"Updated 19 Nov 2020, Added 13 Nov 2020",4 beds,4 baths,5 Toilets,3500000
4,5,5 BEDROOM OFFICE SPACE COMMERCIAL PROPERTY FOR...,off coker roadCoker Road Ilupeju Lagos,Added 18 Nov 2020,5 beds,5 baths,7 Toilets,5000000

In [235]:
pro0= pro[pro['address'].str.contains(area[0])]
pro0.price.describe( )

count    9.000000e+00
mean     3.823333e+07
std      2.569903e+07
min      5.000000e+05
25%      3.300000e+07
50%      4.500000e+07
75%      4.500000e+07
max      8.500000e+07
Name: price, dtype: float64

In [277]:
pro.drop(pro[pro.price == 500].index, inplace=True)

In [278]:
pro[pro.price == 20000]

,Unnamed: 0,title,address,date_added,bed,bath,toilet,price
833,834,COMMERCIAL PROPERTY FOR RENT,ALAUSA CBDAlausa Ikeja Lagos,"Updated 17 Nov 2020, Added 08 Sep 2020",beds,baths,4 Toilets,20000

In [281]:
pro0= pro[pro['address'].str.contains(areas[0])]
pro0.price.describe()

count    9.000000e+00
mean     3.823333e+07
std      2.569903e+07
min      5.000000e+05
25%      3.300000e+07
50%      4.500000e+07
75%      4.500000e+07
max      8.500000e+07
Name: price, dtype: float64

In [297]:
print(pro[pro['address'].str.contains(areas[0])].price.min() , pro[pro['address'].str.contains(areas[0])].price.max())
print(pro[pro['address'].str.contains(areas[0])].price.max())

500000 85000000
85000000

In [324]:

def areas_min_max(areas):
    r = requests.get(url, headers=headers)
    area = BeautifulSoup(r.text, 'html.parser')

    names = area.select('a[href^="/cities/lagos/areas-and-suburbs/"]')
    areas=[]
    for name in names:
        areas.append(name.get_text(strip=True))
    return areas 


area =areas[0:80]
area_min, area_max=[], []
for i in range(0,80):
    min = pro[pro['address'].str.contains(areas[i])].price.min()
    max = pro[pro['address'].str.contains(areas[i])].price.max()
    area_min.append(min), area_max.append(max)

area, areas_min, areas_max = [], [], []
for area in area_min, area_max:
    area = areas
    areas_min = area_min
    areas_max = area_max

In [328]:
area[79]

'Yaba'

In [329]:
compressed_list = pd.DataFrame({'area': area,
                                 'lowest_price': areas_min,
                                 'highest_price': area_max})

compressed_list.to_csv('price_range_by_areas.csv')

In [373]:
prices = pd.read_csv('./price_range_by_areas.csv')

In [374]:
prices.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80 entries, 0 to 79
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Unnamed: 0     80 non-null     int64
 1   area           80 non-null     object
 2   lowest_price   49 non-null     float64
 3   highest_price  49 non-null     float64
dtypes: float64(2), int64(1), object(1)
memory usage: 2.6+ KB

In [375]:
prices

    Unnamed: 0                  area  lowest_price  highest_price
0            0                 Abule      500000.0     85000000.0
1            1         Adeniyi Jones     2000000.0     20000000.0
2            2                 Agege      700000.0       700000.0
3            3             Agidingbi           NaN            NaN
4            4                 Aguda     1000000.0      1500000.0
..         ...                   ...           ...            ...
75          75             Takwa Bay           NaN            NaN
76          76         Tinubu Square           NaN            NaN
77          77  Victoria Garden City           NaN            NaN
78          78       Victoria Island       25000.0     45000000.0
79          79                  Yaba      150000.0     45000000.0

[80 rows x 4 columns]

In [376]:
prices.dropna(axis= 0, how='any', inplace=True)

In [377]:
prices.columns

Index(['Unnamed: 0', 'area', 'lowest_price', 'highest_price'], dtype='object')

In [378]:
prices.drop(labels=['Unnamed: 0'], axis= 1, inplace=True)

In [379]:
prices.head(10)

             area  lowest_price  highest_price
0           Abule      500000.0     85000000.0
1   Adeniyi Jones     2000000.0     20000000.0
2           Agege      700000.0       700000.0
4           Aguda     1000000.0      1500000.0
5            Ajah      250000.0     60000000.0
9           Akoka      500000.0      1500000.0
11      Alagomeji      150000.0       300000.0
12         Alausa       20000.0        20000.0
13       Alimosho      220000.0       220000.0
14   Amuwo Odofin      500000.0      1300000.0

In [381]:
prices.reset_index(inplace=True)

In [385]:
prices.drop(labels=['index'], axis=1, inplace=True)

In [386]:
prices

               area  lowest_price  highest_price
0             Abule      500000.0     85000000.0
1     Adeniyi Jones     2000000.0     20000000.0
2             Agege      700000.0       700000.0
3             Aguda     1000000.0      1500000.0
4              Ajah      250000.0     60000000.0
5             Akoka      500000.0      1500000.0
6         Alagomeji      150000.0       300000.0
7            Alausa       20000.0        20000.0
8          Alimosho      220000.0       220000.0
9      Amuwo Odofin      500000.0      1300000.0
10  Anthony Village       40000.0     80000000.0
11           Bariga      300000.0       300000.0
12            Coker     5000000.0      5000000.0
13   Dolphin Estate     7000000.0      7000000.0
14           Dopemu      700000.0       700000.0
15      Ebute Metta     1300000.0      1300000.0
16              Epe      800000.0       800000.0
17          Gbagada      450000.0     65000000.0
18           Ijesha      600000.0       600000.0
19            Ikeja       20000.0    150000000.0
20          Ikorodu       35000.0     43000000.0
21            Ikoyi       40000.0    310000000.0
22          Ilupeju     5000000.0      5000000.0
23            Iwaya     1500000.0      1500000.0
24      Iyana Ipaja      350000.0       350000.0
25             Ketu      750000.0       750000.0
26           Kosofe      600000.0      5000000.0
27           Ladipo     2200000.0     67500000.0
28   Lagos Mainland      120000.0     15000000.0
29         Lawanson      450000.0       750000.0
30            Lekki       50000.0    320000000.0
31         Maryland       35000.0     80000000.0
32            Mende      650000.0      1500000.0
33           Mushin      800000.0     67500000.0
34             Ogba      120000.0      1000000.0
35            Ogudu      450000.0      3200000.0
36              Ojo      650000.0      6500000.0
37            Ojodu      900000.0      6500000.0
38            Ojota      650000.0       650000.0
39        Ojuelegba     1000000.0      1300000.0
40          Onipanu      400000.0       400000.0
41            Oniru     1200000.0     24000000.0
42           Oregun     2500000.0     67500000.0
43             Sabo      500000.0      4000000.0
44   Satellite Town      500000.0       500000.0
45          Shomolu      300000.0      2700000.0
46         Surulere      450000.0     67000000.0
47  Victoria Island       25000.0     45000000.0
48             Yaba      150000.0     45000000.0

In [387]:
prices.to_csv('new_price_range_by_areas.csv')